El fichero train.csv contiene información sobre los pasajeros del Titanic. 

Descargue el fichero train.csv en su ordenador desde
https://www.kaggle.com/c/titanic/data?select=train.csv

Suba el fichero train.csv a la carpeta sample_data de Google Colab

1. Generar un DataFrame con los datos del fichero.

In [34]:
import pandas as pd

# Generar un DataFrame con los datos del fichero.
titanic = pd.read_csv('sample_data/train.csv', index_col=0)

print(titanic)

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
...               ...     ...  ...   ...      ...
887                 0       2  ...   NaN        S
888                 1       1  ...   B42        S
889                 0       3  ...   NaN        S
890                 1       1  ...  C148        C
891                 0       3  ...   NaN        Q

[891 rows x 11 columns]

2. Mostrar por pantalla las dimensiones del DataFrame y el número de datos que contiene

In [35]:
print('Dimensiones:', titanic.shape)
print('Número de elemntos:', titanic.size)

Dimensiones: (891, 11)
Número de elemntos: 9801

3. Mostrar los nombres de sus columnas y filas

In [36]:
print('Nombres de columnas:', titanic.columns)
print('Nombres de filas:', titanic.index)

Nombres de columnas: Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Nombres de filas: Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            882, 883, 884, 885, 886, 887, 888, 889, 890, 891],
           dtype='int64', name='PassengerId', length=891)

4. Mostrar los tipos de datos del DataFrame

In [37]:
print('Tipos de datos:\n', titanic.dtypes)

Tipos de datos:
 Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [38]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

5. Mostrar las 10 primeras filas y las 10 últimas filas.

In [39]:
print('Primeras 10 filas:\n', titanic.head(10))
print('Últimas 10 filas:\n', titanic.tail(10))

Primeras 10 filas:
              Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
6                   0       3  ...   NaN        Q
7                   0       1  ...   E46        S
8                   0       3  ...   NaN        S
9                   1       3  ...   NaN        S
10                  1       2  ...   NaN        C

[10 rows x 11 columns]
Últimas 10 filas:
              Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
882                 0       3  ...   NaN        S
883                 0       3  ...   NaN        S
884                 0       2  ...   NaN        S
885                 0       3  ...   NaN        S
886                 0       3  ...   NaN        Q
887                 0       2  ...   NaN        S
888                 1       1  ...   B42        S
889                 0       3  ...   NaN        S
890                 1       1  ...  C148        C
891                 0       3  ...   NaN        Q

[10 rows x 11 columns]

6. Mostrar por pantalla los datos del pasajero con identificador 148

In [40]:
# Mostrar por pantalla los datos del pasajero con identificador 148
print(titanic.loc[148])

Survived                                   0
Pclass                                     3
Name        Ford, Miss. Robina Maggie "Ruby"
Sex                                   female
Age                                        9
SibSp                                      2
Parch                                      2
Ticket                            W./C. 6608
Fare                                  34.375
Cabin                                    NaN
Embarked                                   S
Name: 148, dtype: object

In [41]:
#Veamos la diferencia con iloc
# .loc localiza por nombre en el índice
# .iloc localiza por posición en la tabla
titanic.iloc[148]

Survived                                           0
Pclass                                             2
Name        Navratil, Mr. Michel ("Louis M Hoffman")
Sex                                             male
Age                                             36.5
SibSp                                              0
Parch                                              2
Ticket                                        230080
Fare                                              26
Cabin                                             F2
Embarked                                           S
Name: 149, dtype: object

7. Mostrar cuántos pasajeros viajaban en el Titanic

In [42]:
len(titanic)

891

In [43]:
titanic['Survived'].count()

891

8. Mostrar cuántos pasajeros sobrevivieron al naufragio

In [44]:
print(titanic['Survived'].sum())

342

9. Mostrar la suma de las tarifas (columna Fare)

In [45]:
titanic['Fare'].sum()

28693.9493

10. Mostrar la edad media de los pasajeros del Titanic

In [46]:
titanic['Age'].mean()

29.69911764705882

11. Mostrar la edad media de los pasajeros según su género

In [47]:
titanic.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

12. Mostrar las columnas de nombre y edad de los pasajeros

In [48]:
titanic[['Name','Age']]

                                                          Name   Age
PassengerId
1                                      Braund, Mr. Owen Harris  22.0
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
3                                       Heikkinen, Miss. Laina  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
5                                     Allen, Mr. William Henry  35.0
...                                                        ...   ...
887                                      Montvila, Rev. Juozas  27.0
888                               Graham, Miss. Margaret Edith  19.0
889                   Johnston, Miss. Catherine Helen "Carrie"   NaN
890                                      Behr, Mr. Karl Howell  26.0
891                                        Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

13. Mostrar los pasajeros mayores de 65 años

In [49]:
titanic[titanic['Age']>=65]

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
34                  0       2  ...   NaN        S
55                  0       1  ...   B30        C
97                  0       1  ...    A5        C
117                 0       3  ...   NaN        Q
281                 0       3  ...   NaN        Q
457                 0       1  ...   E38        S
494                 0       1  ...   NaN        C
631                 1       1  ...   A23        S
673                 0       2  ...   NaN        S
746                 0       1  ...   B22        S
852                 0       3  ...   NaN        S

[11 rows x 11 columns]

14. Mostrar por pantalla las filas pares del DataFrame.

In [50]:
# Mostrar por pantalla las filas pares del DataFrame.
print(titanic.iloc[range(0,titanic.shape[0],2)])

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
3                   1       3  ...   NaN        S
5                   0       3  ...   NaN        S
7                   0       1  ...   E46        S
9                   1       3  ...   NaN        S
...               ...     ...  ...   ...      ...
883                 0       3  ...   NaN        S
885                 0       3  ...   NaN        S
887                 0       2  ...   NaN        S
889                 0       3  ...   NaN        S
891                 0       3  ...   NaN        Q

[446 rows x 11 columns]

15. Mostrar los nombres de las personas que iban en primera clase ordenadas alfabéticamente.

In [51]:
# Mostrar los nombres de las personas que iban en primera clase ordenadas alfabéticamente.
print(titanic[titanic["Pclass"]==1]['Name'].sort_values())

PassengerId
731                      Allen, Miss. Elisabeth Walton
306                     Allison, Master. Hudson Trevor
298                       Allison, Miss. Helen Loraine
499    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
461                                Anderson, Mr. Harry
                            ...
156                        Williams, Mr. Charles Duane
352             Williams-Lambert, Mr. Fletcher Fellows
56                                   Woolner, Mr. Hugh
556                                 Wright, Mr. George
326                           Young, Miss. Marie Grice
Name: Name, Length: 216, dtype: object

16. Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron

In [52]:
# Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron
print(titanic['Survived'].value_counts()/titanic['Survived'].count() * 100)

# Alternativa
print(titanic['Survived'].value_counts(normalize=True) * 100)

0    61.616162
1    38.383838
Name: Survived, dtype: float64
0    61.616162
1    38.383838
Name: Survived, dtype: float64

17. Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase

In [53]:
#Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase
print(titanic.groupby('Pclass')['Survived'].value_counts(normalize=True))

Pclass  Survived
1       1           0.629630
        0           0.370370
2       0           0.527174
        1           0.472826
3       0           0.757637
        1           0.242363
Name: Survived, dtype: float64

18. Eliminar del DataFrame los pasajeros con edad desconocida.

In [54]:
# Eliminar del DataFrame los pasajeros con edad desconocida.
titanic.dropna(subset=['Age'])

# Alternativa 
# titanic = titanic[titanic['Age'].notna()]

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
...               ...     ...  ...   ...      ...
886                 0       3  ...   NaN        Q
887                 0       2  ...   NaN        S
888                 1       1  ...   B42        S
890                 1       1  ...  C148        C
891                 0       3  ...   NaN        Q

[714 rows x 11 columns]

19. Mostrar la edad media de las mujeres que viajaban en cada clase.

In [55]:
# Mostrar la edad media de las mujeres que viajaban en cada clase.
titanic[titanic['Sex']=='female'].groupby('Pclass')['Age'].mean()

Pclass
1    34.611765
2    28.722973
3    21.750000
Name: Age, dtype: float64

In [56]:
#De otro modo
print(titanic.groupby(['Pclass','Sex'])['Age'].mean().unstack()['female'])

Pclass
1    34.611765
2    28.722973
3    21.750000
Name: female, dtype: float64

20. Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.

In [57]:
# Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.
titanic['Young'] = titanic['Age'] < 18

21. Mostrar el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.

In [58]:
# Mostrar el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.
print(titanic.groupby(['Pclass', 'Young'])['Survived'].value_counts(normalize = True) * 100)

Pclass  Young  Survived
1       False  1           61.274510
               0           38.725490
        True   1           91.666667
               0            8.333333
2       False  0           59.006211
               1           40.993789
        True   1           91.304348
               0            8.695652
3       False  0           78.208232
               1           21.791768
        True   0           62.820513
               1           37.179487
Name: Survived, dtype: float64

22. Añadir una columna con la longitud de caracteres del nombre del pasajero

In [59]:
titanic['Longitud_nombre']=titanic['Name'].apply(lambda x: len(x))
titanic['Longitud_nombre']

PassengerId
1      23
2      51
3      22
4      44
5      24
       ..
887    21
888    28
889    40
890    21
891    19
Name: Longitud_nombre, Length: 891, dtype: int64